class TextMessage:
    FIRST_START_MESSAGE = """
	👋 Привет! Я — <a href="https://t.me/cfogohelper_bot"> CFO GO helper</a>, помощник канала, ваш AI-партнер в карьере и рекрутинге.

Мои текущие возможности:
🔹 Сканирование резюме – проверю на соответствие вакансии, оценю шансы 

🚀 Я учусь и развиваюсь. Скоро у меня появятся новые возможности.

⚠️ Важно:
Сервис доступен только зарегистрированным подписчикам канала <a href="https://t.me/cfosearch">CFO GO</a>."""
    
    

    SCAN_RESUME_MENU = """
	📄 Добро пожаловать в сервис анализа резюме

Я помогу оптимизировать ваше резюме под требования вакансии:
• ✅ ATS-анализ – оценю вероятность прохождения автоматического отбора
• 🔍 Рекомендации – выявлю слабые места и предложу улучшения
• 📊 Сравнение с вакансией – проверю соответствие ключевым критериям

📌 Для анализа потребуется:

📎 Ваше резюме (поддерживаемые форматы: PDF, Word)

📋 Текст вакансии (можно отправить текстом, ссылкой на hh.ru или переслать сообщение из канала @cfosearch или другого)
	"""
     

    SCAN_RESUME_FIRST_MESSAGE ='''
→ Прикрепите и отправьте ваше резюме (поддерживаемые форматы: PDF, Word , DOCX, TXT) в ответном сообщении, чтобы начать анализ.
'''

    SCAN_RESUME_SECOND_MESSAGE = """
	→ А теперь пришли мне вакансию, на которую планируешь откликнуться. Вставь текст, дай ссылку с hh.ru или перешли из телеграмм канала. Можно оставить поле пустым или просто написать желаемую должность, но тогда анализ будет не полным.
	"""
	
    SCAN_RESUME_THIRD_MESSAGE = """
	Спасибо! Подожди минутку, я подготовлю рекомендации...
	"""
    START_MESSAGE = """
	📊 CFO Helper | Главное меню

Привет! Я помогу с анализом резюме и поиском работы в финансах.

🛠 Доступные услуги:
🔍 Сканирование резюме – ATS-анализ + рекомендации
🚀  Новые функции готовятся к к запуску

💰 Тарифы:
• Бесплатно: 3 сканирования (для новых пользователей)
• Платно: Дополнительные пакеты сканирований (5/10/20/50 проверок)

➡️ Выберите действие:
	"""
	
    CHANNEL_MESSAGE = """
	 "Для работы с ботом необходимо подписаться на канала CFO GO (@cfosearch)
	"""
    
    PAYMENT_MESSAGE = """
	Вы можете приобрести пакет скринингов начиная от 5 шт. Каждый скрининг - рекомендации с анализом 1 резюме на 1 вакансию."
	"""
    

    
    
    
    