class TextMessage:
    FIRST_START_MESSAGE = """
	👋 Привет! Я — <a href="https://t.me/cfogohelper_bot"> CFO GO helper</a>, помощник канала, ваш AI-партнер в карьере и рекрутинге.

Мои текущие возможности:
🔹 Сканирование резюме – проверю на соответствие вакансии, оценю шансы 

🚀 Я учусь и развиваюсь. Скоро у меня появятся новые возможности.

⚠️ Важно:
Сервис доступен только зарегистрированным подписчикам канала <a href="https://t.me/cfosearch">CFO GO</a>."""
    
    

    SCAN_RESUME_FIRST_MESSAGE = """
	Я просканирую твое резюме на интересующую тебя вакансию и дам рекомендации что нужно поправить.
	Пришли мне свое резюме в ответном сообщении
	"""

    SCAN_RESUME_SECOND_MESSAGE = """
	А теперь дай мне ссылку на интересующую тебя вакансию или назови должность и отрасль​(Пока поддерживаются только ссылки на вакансии с hh.ru)
	"""
	
    SCAN_RESUME_THIRD_MESSAGE = """
	Спасибо! Подожди минутку, я подготовлю рекомендации...
	"""
    START_MESSAGE = """
	📊 CFO Helper | Главное меню

Привет! Я помогу с анализом резюме и поиском работы в финансах.

🛠 Доступные услуги:
🔍 Сканирование резюме – ATS-анализ + рекомендации
🚀  Новые функции готовятся к к запуску

💰 Тарифы:
• Бесплатно: 3 сканирования (для новых пользователей)
• Платно: Дополнительные пакеты сканирований (10/50/100 проверок)

➡️ Выберите действие:
	"""
	
    CHANNEL_MESSAGE = """
	 "Для работы с ботом необходимо подписаться на канала CFO GO (@cfosearch)
	"""
    
    PAYMENT_MESSAGE = """
	Вы можете приобрести пакет скринингов начиная от 5 шт. Каждый скрининг - рекомендации с анализом 1 резюме на 1 вакансию."
	"""
    
    
    
    
    
    