class TextMessage:
    START_MESSAGE = """
	👋 Привет! Я — CFO GO helper (@cfogohelper_bot - вставить ссылкой), помощник канала CFO GO (@cfosearch - вставить ссылкой), ваш AI-партнер в карьере и рекрутинге.

Мои текущие возможности:
🔹 Анализ резюме – проверю соответствие вакансии, оценю шансы 

🚀 Я учусь и развиваюсь. Скоро у меня появятся новые возможности.

⚠️ Важно:
Сервис доступен только зарегистрированным подписчикам канала @cfosearch.
"""
    
    

    SCAN_RESUME_FIRST_MESSAGE = """
	Я просканирую твое резюме на интересующую тебя вакансию и дам рекомендации что нужно поправить.
	Пришли мне свое резюме в ответном сообщении
	"""

    SCAN_RESUME_SECOND_MESSAGE = """
	А теперь дай мне ссылку на интересующую тебя вакансию или назови должность и отрасль​(Пока поддерживаются только ссылки на вакансии с hh.ru)
	"""
	
    SCAN_RESUME_THIRD_MESSAGE = """
	Спасибо! Подожди минутку, я подготовлю рекомендации...
	"""
    ON_START_MESSAGE = """
	Проверь, что ты подписан на канал: CFO GO | Онлайн-агрегатор вакансий для финансистов / @cfosearch. Только зарегистрированные пользователи могут воспользоваться моими услугами
	"""
	
    CHANNEL_MESSAGE = """
	 "Для работы с ботом необходимо подписаться на канала CFO GO (@cfosearch)
	"""
    
    PAYMENT_MESSAGE = """
	Вы можете приобрести пакет скринингов начиная от 5 шт. Каждый скрининг - рекомендации с анализом 1 резюме на 1 вакансию."
	"""
    
    
    
    
    
    