class TextMessage:
    START_MESSAGE = """
	Привет!
	Я бот-помощник проекта CFOGO. Помогаю кандидатам доработать резюме. Попробуй и ты!
"""

    SCAN_RESUME_FIRST_MESSAGE = """
	Я просканирую твое резюме на интересующую тебя вакансию и дам рекомендации что нужно поправить.
	Пришли мне свое резюме в ответном сообщении
	"""

    SCAN_RESUME_SECOND_MESSAGE = """
	А теперь дай мне ссылку на интересующую тебя вакансию или назови должность и отрасль​(Пока поддерживаются только ссылки на вакансии с hh.ru)
	"""
	
    SCAN_RESUME_THIRD_MESSAGE = """
	Спасибо! Подожди минутку, я подготовлю рекомендации...
	"""
    ON_START_MESSAGE = """
	Проверь, что ты подписан на канал: CFO GO | Онлайн-агрегатор вакансий для финансистов / @cfosearch. Только зарегистрированные пользователи могут воспользоваться моими услугами
	"""
	
    CHANNEL_MESSAGE = """
	Для работы с ботом необходимо подписаться на канал CFO GO | Онлайн-агрегатор вакансий для финансистов @cfosearch
	"""
    
    PAYMENT_MESSAGE = """
	Вы можете приобрести пакет скринингов начиная от 5 шт. Каждый скрининг - рекомендации с анализом 1 резюме на 1 вакансию."
	"""
    
    
    
    
    
    