class TextMessage:
    START_MESSAGE = """
	Привет!
	Я бот-помощник проекта CFOGO. Помогаю кандидатам доработать резюме. Попробуй и ты!
"""

    SCAN_RESUME_FIRST_MESSAGE = """
	Я просканирую твое резюме на интересующую тебя вакансию и дам рекомендации что нужно поправить.
	Пришли мне свое резюме в ответном сообщении
	"""

    SCAN_RESUME_SECOND_MESSAGE = """
	А теперь дай мне ссылку на интересующую тебя вакансию или назови должность и отрасль​
	"""

    SCAN_RESUME_THIRD_MESSAGE = """
	Спасибо! Подожди минутку, я подготовлю рекомендации...
	"""
